In [14]:
import pandas as pd
import numpy as np

Feature 1 Read data - Read data from a csv file.

In [15]:
Asian_df = pd.read_csv("Educational Attainment_asian.csv")
print(Asian_df.info())
print("number of rows : ", Asian_df.shape[0])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 18 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Gender                            42 non-null     object
 1   Characteristic                    42 non-null     object
 2   Total                             42 non-null     object
 3   None                              42 non-null     object
 4   1st - 4th grade                   42 non-null     int64
 5   5th - 6th grade                   42 non-null     int64
 6   7th - 8th grade                   42 non-null     int64
 7   9th grade                         42 non-null     int64
 8   10th grade                        42 non-null     object
 9   11th grade                        42 non-null     int64
 10  High school graduate              42 non-null     object
 11  Some college, no degree           42 non-null     object
 12  Associate's degree, occupational  42 non-null     int64
 13  Associate's degree, academic      42 non-null     int64
 14  Bachelor's degree                 42 non-null     object
 15  Master's degree                   42 non-null     object
 16  Professional degree               42 non-null     int64
 17  Doctoral degree                   42 non-null     int64
dtypes: int64(9), object(9)
memory usage: 6.0+ KB
None
number of rows :  42

Feature 2 - Manipulate and clean your data: Included a column in the database called Ethnicity. Included the value under this column called Asian.

In [16]:
Asian_df['Ethnicity']= "Asian"

In [17]:
Asian_df.columns

Index(['Gender', 'Characteristic', 'Total', 'None', '1st - 4th grade',
       '5th - 6th grade', '7th - 8th grade', '9th grade', '10th grade',
       '11th grade', 'High school graduate', 'Some college, no degree',
       'Associate's degree, occupational', 'Associate's degree, academic',
       'Bachelor's degree', 'Master's degree', 'Professional degree',
       'Doctoral degree', 'Ethnicity'],
      dtype='object')

In [18]:
display(Asian_df.Ethnicity)

0     Asian
1     Asian
2     Asian
3     Asian
4     Asian
5     Asian
6     Asian
7     Asian
8     Asian
9     Asian
10    Asian
11    Asian
12    Asian
13    Asian
14    Asian
15    Asian
16    Asian
17    Asian
18    Asian
19    Asian
20    Asian
21    Asian
22    Asian
23    Asian
24    Asian
25    Asian
26    Asian
27    Asian
28    Asian
29    Asian
30    Asian
31    Asian
32    Asian
33    Asian
34    Asian
35    Asian
36    Asian
37    Asian
38    Asian
39    Asian
40    Asian
41    Asian
Name: Ethnicity, dtype: object

Feature 2 - Manipulate and clean your data: Changed the value under column Gender from "Both Sexes" to "Both Genders" for a more consistent terminology.

In [19]:
Asian_df['Gender'] = Asian_df['Gender'].replace(['Both Sexes'], 'Both Genders')

In [20]:
display(Asian_df.Gender)

0     Both Genders
1     Both Genders
2     Both Genders
3     Both Genders
4     Both Genders
5     Both Genders
6     Both Genders
7     Both Genders
8     Both Genders
9     Both Genders
10    Both Genders
11    Both Genders
12    Both Genders
13    Both Genders
14            Male
15            Male
16            Male
17            Male
18            Male
19            Male
20            Male
21            Male
22            Male
23            Male
24            Male
25            Male
26            Male
27            Male
28          Female
29          Female
30          Female
31          Female
32          Female
33          Female
34          Female
35          Female
36          Female
37          Female
38          Female
39          Female
40          Female
41          Female
Name: Gender, dtype: object

In [21]:
Black_df = pd.read_csv("Educational Attainment_black.csv")
Black_df['Ethnicity']= "Black or African American"
Black_df['Gender'] = Black_df['Gender'].replace(['Both Sexes'], 'Both Genders')
print(Black_df.info())
print("number of rows : ", Black_df.shape[0])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 19 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Gender                            42 non-null     object
 1   Characteristic                    42 non-null     object
 2   Total                             42 non-null     object
 3   None                              42 non-null     int64
 4   1st - 4th grade                   42 non-null     int64
 5   5th - 6th grade                   42 non-null     int64
 6   7th - 8th grade                   42 non-null     int64
 7   9th grade                         42 non-null     int64
 8   10th grade                        42 non-null     int64
 9   11th grade                        42 non-null     object
 10  High school graduate              42 non-null     object
 11  Some college, no degree           42 non-null     object
 12  Associate's degree, occupational  42 non-null     object
 13  Associate's degree, academic      42 non-null     object
 14  Bachelor's degree                 42 non-null     object
 15  Master's degree                   42 non-null     object
 16  Professional degree               42 non-null     object
 17  Doctoral degree                   42 non-null     int64
 18  Ethnicity                         42 non-null     object
dtypes: int64(7), object(12)
memory usage: 6.4+ KB
None
number of rows :  42

In [22]:
Hispanic_df = pd.read_csv("Educational Attainment_hispanic.csv")
Hispanic_df['Ethnicity']= "Hispanic or LatinX"
Hispanic_df['Gender'] = Hispanic_df['Gender'].replace(['Both Sexes'], 'Both Genders')
print(Hispanic_df.info())
print("number of rows : ", Hispanic_df.shape[0])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 19 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Gender                            42 non-null     object
 1   Characteristic                    42 non-null     object
 2   Total                             42 non-null     object
 3   None                              42 non-null     float64
 4   1st - 4th grade                   42 non-null     object
 5   5th - 6th grade                   42 non-null     object
 6   7th - 8th grade                   42 non-null     object
 7   9th grade                         42 non-null     object
 8   10th grade                        42 non-null     float64
 9   11th grade                        42 non-null     object
 10  High school graduate              42 non-null     object
 11  Some college, no degree           42 non-null     object
 12  Associate's degree, occupational  42 non-null     object
 13  Associate's degree, academic      42 non-null     object
 14  Bachelor's degree                 42 non-null     object
 15  Master's degree                   42 non-null     object
 16  Professional degree               42 non-null     float64
 17  Doctoral degree                   42 non-null     float64
 18  Ethnicity                         43 non-null     object
dtypes: float64(4), object(15)
memory usage: 6.5+ KB
None
number of rows :  43

In [23]:
White_df = pd.read_csv("Educational Attainment_white.csv")
White_df['Ethnicity']= "White"
White_df['Gender'] = White_df['Gender'].replace(['Both Sexes'], 'Both Genders')
print(White_df.info())
print("number of rows : ", White_df.shape[0])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 19 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Gender                            42 non-null     object
 1   Characteristic                    42 non-null     object
 2   Total                             42 non-null     object
 3   None                              42 non-null     int64
 4   1st - 4th grade                   42 non-null     object
 5   5th - 6th grade                   42 non-null     object
 6   7th - 8th grade                   42 non-null     object
 7   9th grade                         42 non-null     object
 8   10th grade                        42 non-null     object
 9   11th grade                        42 non-null     object
 10  High school graduate              42 non-null     object
 11  Some college, no degree           42 non-null     object
 12  Associate's degree, occupational  42 non-null     object
 13  Associate's degree, academic      42 non-null     object
 14  Bachelor's degree                 42 non-null     object
 15  Master's degree                   42 non-null     object
 16  Professional degree               42 non-null     object
 17  Doctoral degree                   42 non-null     object
 18  Ethnicity                         42 non-null     object
dtypes: int64(1), object(18)
memory usage: 6.4+ KB
None
number of rows :  42

In [24]:
frames = [Asian_df, Hispanic_df, Black_df, White_df]
  
Merged_AllEthnicity = pd.concat(frames)
print(Merged_AllEthnicity.info())
print("number of rows : ", Merged_AllEthnicity.shape[0])

<class 'pandas.core.frame.DataFrame'>
Int64Index: 169 entries, 0 to 41
Data columns (total 19 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Gender                            168 non-null    object
 1   Characteristic                    168 non-null    object
 2   Total                             168 non-null    object
 3   None                              168 non-null    object
 4   1st - 4th grade                   168 non-null    object
 5   5th - 6th grade                   168 non-null    object
 6   7th - 8th grade                   168 non-null    object
 7   9th grade                         168 non-null    object
 8   10th grade                        168 non-null    object
 9   11th grade                        168 non-null    object
 10  High school graduate              168 non-null    object
 11  Some college, no degree           168 non-null    object
 12  Associate's degree, occupational  168 non-null    object
 13  Associate's degree, academic      168 non-null    object
 14  Bachelor's degree                 168 non-null    object
 15  Master's degree                   168 non-null    object
 16  Professional degree               168 non-null    object
 17  Doctoral degree                   168 non-null    object
 18  Ethnicity                         169 non-null    object
dtypes: object(19)
memory usage: 26.4+ KB
None
number of rows :  169

In [25]:
Merged_AllEthnicity.head()

,Gender,Characteristic,Total,None,1st - 4th grade,5th - 6th grade,7th - 8th grade,9th grade,10th grade,11th grade,High school graduate,"Some college, no degree","Associate's degree, occupational","Associate's degree, academic",Bachelor's degree,Master's degree,Professional degree,Doctoral degree,Ethnicity
0,Both Genders,\t 18 years and over,"15,954",133,64,152,185,120,139,406,"2,795","1,776",385,644,"5,219","2,828",332,777,Asian
1,Both Genders,\t\t 18 to 24 years,"1,707",5,0,0,4,6,17,157,266,711,13,64,421,39,0,2,Asian
2,Both Genders,\t 25 years and over,"14,247",128,64,152,181,114,122,249,"2,529","1,065",372,580,"4,798","2,788",332,775,Asian
3,Both Genders,\t\t 25 to 29 years,"1,596",0,0,0,3,0,10,25,169,157,42,56,689,390,21,35,Asian
4,Both Genders,\t\t 30 to 34 years,"1,679",2,0,7,9,5,8,15,157,111,43,85,564,524,44,106,Asian

In [28]:
Merged_AllEthnicity.rename(columns={'Characteristic' : 'Age Group'}, inplace=True)
Merged_AllEthnicity.head()

,Gender,Age Group,Total,None,1st - 4th grade,5th - 6th grade,7th - 8th grade,9th grade,10th grade,11th grade,High school graduate,"Some college, no degree","Associate's degree, occupational","Associate's degree, academic",Bachelor's degree,Master's degree,Professional degree,Doctoral degree,Ethnicity
0,Both Genders,\t 18 years and over,"15,954",133,64,152,185,120,139,406,"2,795","1,776",385,644,"5,219","2,828",332,777,Asian
1,Both Genders,\t\t 18 to 24 years,"1,707",5,0,0,4,6,17,157,266,711,13,64,421,39,0,2,Asian
2,Both Genders,\t 25 years and over,"14,247",128,64,152,181,114,122,249,"2,529","1,065",372,580,"4,798","2,788",332,775,Asian
3,Both Genders,\t\t 25 to 29 years,"1,596",0,0,0,3,0,10,25,169,157,42,56,689,390,21,35,Asian
4,Both Genders,\t\t 30 to 34 years,"1,679",2,0,7,9,5,8,15,157,111,43,85,564,524,44,106,Asian

In [34]:
Merged_AllEthnicity['Age Group'] = Merged_AllEthnicity['Age Group'].str.replace('\t\t ', '')
Merged_AllEthnicity['Age Group'] = Merged_AllEthnicity['Age Group'].str.replace('\t ', '')
Merged_AllEthnicity['Age Group'] = Merged_AllEthnicity['Age Group'].str.replace('\t\t', '')
Merged_AllEthnicity['Age Group'] = Merged_AllEthnicity['Age Group'].str.strip()
Merged_AllEthnicity['Age Group'].unique()

array(['18 years and over', '18 to 24 years', '25 years and over',
       '25 to 29 years', '30 to 34 years', '35 to 39 years',
       '40 to 44 years', '45 to 49 years', '50 to 54 years',
       '55 to 59 years', '60 to 64 years', '65 to 69 years',
       '70 to 74 years', '75 years and over', nan], dtype=object)

In [36]:
Merged_AllEthnicity[Merged_AllEthnicity['Age Group'].isna()]

,Gender,Age Group,Total,None,1st - 4th grade,5th - 6th grade,7th - 8th grade,9th grade,10th grade,11th grade,High school graduate,"Some college, no degree","Associate's degree, occupational","Associate's degree, academic",Bachelor's degree,Master's degree,Professional degree,Doctoral degree,Ethnicity
42,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Hispanic or LatinX

In [39]:
Merged_AllEthnicity.drop(Merged_AllEthnicity[Merged_AllEthnicity['Age Group'].isna()].index, inplace=True)
print(Merged_AllEthnicity.info())
print("number of rows : ", Merged_AllEthnicity.shape[0])

<class 'pandas.core.frame.DataFrame'>
Int64Index: 168 entries, 0 to 41
Data columns (total 19 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Gender                            168 non-null    object
 1   Age Group                         168 non-null    object
 2   Total                             168 non-null    object
 3   None                              168 non-null    object
 4   1st - 4th grade                   168 non-null    object
 5   5th - 6th grade                   168 non-null    object
 6   7th - 8th grade                   168 non-null    object
 7   9th grade                         168 non-null    object
 8   10th grade                        168 non-null    object
 9   11th grade                        168 non-null    object
 10  High school graduate              168 non-null    object
 11  Some college, no degree           168 non-null    object
 12  Associate's degree, occupational  168 non-null    object
 13  Associate's degree, academic      168 non-null    object
 14  Bachelor's degree                 168 non-null    object
 15  Master's degree                   168 non-null    object
 16  Professional degree               168 non-null    object
 17  Doctoral degree                   168 non-null    object
 18  Ethnicity                         168 non-null    object
dtypes: object(19)
memory usage: 26.2+ KB
None
number of rows :  168

In [44]:
Merged_AllEthnicity['Age Group'].unique()

array(['18 years and over', '18 to 24 years', '25 years and over',
       '25 to 29 years', '30 to 34 years', '35 to 39 years',
       '40 to 44 years', '45 to 49 years', '50 to 54 years',
       '55 to 59 years', '60 to 64 years', '65 to 69 years',
       '70 to 74 years', '75 years and over'], dtype=object)

Demographics- Count population, percentage; (pie) Ethnicity & Age (stacked bar plot)

Overall (18year and over) - Ethnicity vs. High school graduate, Associate's degree occupational + Associate's degree, academic, Bachelor's degree, Master's degree + Professional degree + Doctoral degree, Master's degree, Professional degree , Doctoral degree; Bar Plot

Stacked Bar plot - High school, College (Associate + Bachelor)+ higher education - The bars would be the age group (Ex: 18 to 24 years, 25 to 29 years, etc.. )